int/resources/objectRepo/xmlTemplates/ows/OWSReservation/req_GetReservationStatus.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:res="http://webservices.micros.com/ows/5.1/Reservation.wsdl" xmlns:res1="http://webservices.micros.com/og/4.3/Reservation/">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:GetReservationStatusRequest>
         <res:HotelReference chainCode="?" hotelCode="?"/>
         <res:ConfirmationNumber/>
         <res:LegNumber/>
         <res:ExternalSystemNumber>
            <res1:ReferenceNumber/>
            <res1:LegNumber/>
            <res1:ReferenceType/>
         </res:ExternalSystemNumber>
         <res:MembershipType/>
         <res:MembershipNumber/>
         <res:LastName/>
         <res:FirstName/>
      </res:GetReservationStatusRequest>
   </soapenv:Body>
</soapenv:Envelope>